log_nodeport_2x32_3cpu_single.txt
WARNING 10-08 23:42:58 _custom_ops.py:18] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url=None, host='216.81.245.85', port=30301, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='meta-llama/Meta-Llama-3-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=10240, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=2.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
============ Serving Benchmark Result ============
Successful requests:                     8746      
Benchmark duration (s):                  26677.31  
Total input tokens:                      1866666   
Total generated tokens:                  1661321   
Request throughput (req/s):              0.33      
Input token throughput (tok/s):          69.97     
Output token throughput (tok/s):         62.27     
---------------Time to First Token----------------
Mean TTFT (ms):                          140549.71 
Median TTFT (ms):                        170857.72 
P99 TTFT (ms):                           179837.09 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          82.02     
Median TPOT (ms):                        70.66     
P99 TPOT (ms):                           306.31    
---------------Inter-token Latency----------------
Mean ITL (ms):                           71.89     
Median ITL (ms):                         53.65     
P99 ITL (ms):                            429.63    
==================================================