log_rdma_25rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest2.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=2.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.5
============ Serving Benchmark Result ============
Successful requests:                     8403      
Benchmark duration (s):                  8261.08   
Total input tokens:                      1270115   
Total generated tokens:                  1814928   
Request throughput (req/s):              1.02      
Input token throughput (tok/s):          153.75    
Output token throughput (tok/s):         219.70    
---------------Time to First Token----------------
Mean TTFT (ms):                          46403.51  
Median TTFT (ms):                        48836.74  
P99 TTFT (ms):                           50058.72  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          130.94    
Median TPOT (ms):                        112.15    
P99 TPOT (ms):                           483.94    
---------------Inter-token Latency----------------
Mean ITL (ms):                           114.51    
Median ITL (ms):                         97.49     
P99 ITL (ms):                            406.73    
==================================================